// function random(lastValue ,length){
//     var num =  Math.floor((Math.random()* length)) ;
//     if(lastValue == num) {
//         if(num==length ){
//             --num;
//         }
//         else{
//             ++num ; 
//         }
//     }
//     return num ;
    
// }

// var Number ;

// function Quote(){
//     var qoue = ["العهد الذي بيننا وبينهم الصلاة فمن تركها فهو كافر" , "لا تَحقِرَنَّ مِنَ المَعْرُوف شَيْئًا، وَلَو أنْ تَلقَى أخَاكَ بوجهٍ طليقٍ" , `يا بُنَيّ
//     إنَّ النَّعِيم لا يُدرَك بالنَّعيم!
//     من أراد الجنَّة شمَّر عن ساقَيهِ ومشى
//     ولا مُسترَاح إلا هُناك.`, `كانتْ غايتُه أن ينجوَ منها كفافًا؛ 
//     لا له ، ولا عليه.` , `يا عبادي كلُّكم ضالٌّ إلَّا من هديتُه` , "با عبادي انما هي اعمالكم أحصيها لكم ثم أوفيكم اياها ، فمن وجد خيرا فليحمد الله ، ومن وجد غير ذلك فلا يلومن الا نفسه"  , "ينهى العصاه بعضهم بعضا فلو لم يعظ الا معصوم من الزلل لم يعظ الناس بعد رسول الله ﷺ أحد لانه لا عصمة لأحد بعده يا عزيزي "] ;
//     var text = [ "رسولُ الله ﷺ" , "رسولُ الله ﷺ" , "عمر ابن الخطاب" , "عمر ابن الخطاب" , " رسولُ الله ﷺ عن ربه" , " رسولُ الله ﷺ عن ربه" , "أخاك الساعي عسانا نقبل" ] ;
//     Number = random(Number , (qoue.length -1))
//     document.getElementById("Quote").innerHTML=qoue[Number] ;
//     document.getElementById("Aouthor").innerHTML=text[Number] ;
// }



 
 
 





